
#Область ПрограммныйИнтерфейс

Процедура ПриСозданииЧтенииНаСервере(Форма) Экспорт
	
	// Инициализация настроек изменения и проверка программного изменения формы.
	Настройки = НастройкиИзмененияФорм();
	
	Если ФормаДоработана(Форма, Настройки) Тогда
		Возврат;
	КонецЕсли;
	
	// Формирование настроек программного измения для дальнейшей обработки.
	ЗаполнитьНастройкиПрограммногоИзменения(Форма, Настройки);
	
	// Обработка формы по структуре действий из настроек.
	ОбработатьФорму(Форма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНастройкиПрограммногоИзменения(Форма, Настройки)
	
	Элементы = Форма.Элементы;
	
	Если Форма.ИмяФормы = "" Тогда
		Возврат;
	#Область Справочники
	
	#КонецОбласти
	
	#Область Документы
	
	#КонецОбласти
	
	#Область Обработки
	
	#КонецОбласти
	
	#Область Регистры
	
	#КонецОбласти
	
	#Область ОбщиеФормы
	
	#КонецОбласти
	
	#Область Прочее
	
	#КонецОбласти
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьФорму(Форма, Настройки)
	
	Форма.ИзменитьРеквизиты(Настройки.ДобавляемыеРеквизиты, Настройки.УдаляемыеРеквизиты);
	
	Форма[Настройки.ИмяРеквизитаПроверки] = Истина;
	
КонецПроцедуры

Функция НастройкиИзмененияФорм()
	
	Настройки = Новый Структура;
	
	Настройки.Вставить("ИмяРеквизитаПроверки", "ааФормаДоработана");
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Настройки.ИмяРеквизитаПроверки, ОписаниеТиповБулево()));
	
	Настройки.Вставить("ДобавляемыеРеквизиты", ДобавляемыеРеквизиты);
	Настройки.Вставить("УдаляемыеРеквизиты", Новый Массив);
	
	Возврат Настройки;
	
КонецФункции

Функция ФормаДоработана(Форма, Настройки)
	
	СтруктураПроверки = Новый Структура(Настройки.ИмяРеквизитаПроверки);
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, Форма);
	
	Возврат СтруктураПроверки[Настройки.ИмяРеквизитаПроверки] <> Неопределено;
	
КонецФункции

#Область ОписаниеТипов

Функция ОписаниеТиповБулево()
	Возврат Новый ОписаниеТипов("Булево");
КонецФункции

#КонецОбласти

#КонецОбласти
